<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"fc3f342eb32a925fb8b851a3702c9b6aab951d4f20d5df84f4147f8dac14d949","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #967 at https://github.com/cal-itp/data-infra/actions/runs/19340952817","plan_out_hash":"5a68a67b4c2e5341df5648d432d5fb55f93fa4c440282cb5cbfe4504be75e17b","plan_hash":"a6398fc684697c55d0bb21dc3f35e1bf6a580b7cb34c85a4fc2f46786bc1bed3","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/dags.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "tQl0DA==" -> (known after apply)
!~      detect_md5hash      = "B95K3uhC41c6uMX4cvS/GA==" -> "different hash"
!~      generation          = 1757464205425677 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dags.py"
!~      md5hash             = "B95K3uhC41c6uMX4cvS/GA==" -> (known after apply)
        name                = "dags/dags.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #967](https://github.com/cal-itp/data-infra/actions/runs/19340952817)